{
    "version": "https://jsonfeed.org/version/1",
    "title": "mypillowprice.com",
    "description": "",
    "home_page_url": "https://mypillowprice.com",
    "feed_url": "https://mypillowprice.com/feed.json",
    "user_comment": "",
    "icon": "https://mypillowprice.com/media/website/mypillowprice-logo.jpg",
    "author": {
        "name": "Sathi"
    },
    "items": [
        {
            "id": "https://mypillowprice.com/pregnancy-pillow-review-from-users.html",
            "url": "https://mypillowprice.com/pregnancy-pillow-review-from-users.html",
            "title": "Pregnancy pillow review from users",
            "summary": "PharMeDoc Pregnancy Pillow with Jersey Cover, C Shaped Full Body PillowPharMeDoc is&hellip;",
            "content_html": "<h2 id=\"mcetoc_1d1jfe6c10\">PharMeDoc Pregnancy Pillow with Jersey Cover, C Shaped Full Body Pillow</h2>\n<p>PharMeDoc is specialized in pillow comfort, especially for the expecting mother. It is one of the most popular among body pillows. This c-shaped pillow design is specific for supporting the discomfort of pregnancy surrounding back needs, as well as support for, hips, knees, neck, and head. Because of this innovative c shape design, it will replace the necessity of multiple pillows in bed. With the support of this great pillow, you will be able to watch television, read a book or do your office works on your computer.</p>\n<p>The 62-inch length and 29-inch width that is entirely adjustable take measures this full body, slightly c-shaped pillow versatility to use at any point in your pregnancy, or even for body pillow support evermore. C-shape pregnancy pillow can help comfort you into better sleep, decrease obstacle entirely the night and helping relieve back pain connected with pregnancy. PharMeDoc C-Shape full body pillow replaces the need for up to multiple pillows. uphold your head, neck, spine, belly, back, hips, and legs.</p>\n<p>C Shaped Full Body Pillow seriously is so soft and comfortable. What's great is that you can twist and fold the thing in a lot of different ways to accommodate how you are feeling &amp; how your body is changing. This pillow is a pregnancy game-changer.</p>\n<p>This c-shaped full body pillow easy to clean, easy to rearrange and is incredibly soft. <br>locality this product in a number of configurations on your bed, couch, sofa, or even the floor.</p>\n<h2 id=\"mcetoc_1d1jgme0i0\">Specifiations:</h2>\n<table class=\"specifications\">\n<tbody>\n<tr>\n<td><strong>Item weight</strong></td>\n<td>7.05 Pounds</td>\n</tr>\n<tr>\n<td><strong>Product dimentions</strong></td>\n<td>61.8 x 29.1 x 5.9 inches</td>\n</tr>\n<tr>\n<td><strong>Item model number</strong></td>\n<td>PMD-C-BP-JC</td>\n</tr>\n<tr>\n<td><strong>Material type</strong></td>\n<td>100% Soft Jersey Knit Cotton</td>\n</tr>\n</tbody>\n</table>\n<p> </p>",
            "image": "https://mypillowprice.com/media/posts/1/",
            "author": {
                "name": "Sathi"
            },
            "tags": [
            ],
            "date_published": "2019-01-19T22:36:15+06:00",
            "date_modified": "2019-01-26T23:14:41+06:00"
        }
    ]
}
